{
    "reviews": [
      {
        "author": "Jaswinder Singh",
        "rating": 5,
        "content": "Assure Pathlabs is a great option for blood tests. The service is very knowledgeable and the staff was awesome! They were all very friendly and willing to help me test my blood at any given time. I would recommend them to anyone that wants their blood tested at a good price."
      },
      {
        "author": "Pooja Mishra",
        "rating": 5,
        "content": "Assure PathLab deserves a standing ovation for their excellent service. From the moment I walked in, I felt reassured by their knowledgeable staff. The quick turnaround time for test results was a pleasant surprise. If you're looking for reliability and professionalism, this is the place to go."
      },
      {
        "author": "Paramjit Sandhu",
        "rating": 5,
        "content": "Assure Pathlabs was a great experience. The staff was very friendly and willing to go out of their way to help you. I would definitely recommend them to anyone that wants blood tests done at an affordable price."
      },
      {
        "author": "Manjit Kaur",
        "rating": 5,
        "content": "I used Assure labs a few times as a part of my routine health checkup and always had great results! The staff was extremely professional and friendly throughout my entire procedure, which is not common with numerous other labs. My experience with them was very pleasant, and I would definitely order from them again! Thank you!"
      },
      {
        "author": "Deepa Burnwal",
        "rating": 5,
        "content": "Assure PathLab is an absolute lifesaver! Their prompt and professional service made my medical tests a breeze. The friendly staff and seamless process left me with nothing to worry about. recommended!"
      },
      {
        "author": "Baljit Kaur",
        "rating": 5,
        "content": "I love Assure Lab. Their staff is very professional and always supportive. I would recommend them to everyone as they have amazing customer support. I spoke to someone who was very knowledgeable about my test, and she was able to provide me with..."
      },
      {
        "author": "Sakshi",
        "rating": 5,
        "content": "The staff at Assure Pathlab is not only professional but also incredibly knowledgeable. They took the time to explain my test results in detail, ensuring I understood my health status. Great expertise!"
      },
      {
        "author": "Tani Raj",
        "rating": 5,
        "content": "Assure Pathlabs provided exceptional service with their quick and accurate test results. Their staff was friendly and efficient, making my experience smooth and hassle-free."
      },
      {
        "author": "Rachpal Singh",
        "rating": 5,
        "content": "Professional and clean. Most of the times visited them in off-peak hours. Experience was smooth and flawless. Reports are sent via SMS promptly. In our case, CBC reports were sent within 1.5 hours. You can follow up on the phone as well in case there are concerns. Stay healthy and Stay Fit. Thanks."
      },
      {
        "author": "RIA SAMANTA",
        "rating": 5,
        "content": "I was very pleased with the service I received from Assure Pathlabs Blood Test Center. It is such a relief to have found such a reliable place outside of the hospital to have my blood tests done, they always explain everything you need to know about your health and take their time to make sure you understand everything"
      },
      {
        "author": "Trisha Sengupta",
        "rating": 5,
        "content": "I have been using Assure Pathlabs for a long time and I am always pleased with their services. The staff is extremely friendly and they are always willing to help you in whatever way they can, which is great. I highly recommend them to anyone looking for a reliable blood lab."
      },
      {
        "author": "Maninder Singh",
        "rating": 5,
        "content": "This lab is the most trusted lab in Jalandhar. Staff is polite and experienced. Charges are reasonable. I salute this lab and its staff who served the people risking their lives during the covid pandemic when reputed labs in Jalandhar stopped doing tests. This is my personal experience"
      },
      {
        "author": "Tubhai",
        "rating": 5,
        "content": "Efficient and reliable, Assure PathLab sets the gold standard for diagnostic testing. Their online portal makes it easy to access reports, and their attention to detail is second to none."
      },
      {
        "author": "Aman Jha",
        "rating": 5,
        "content": "Assure PathLab provides top-notch diagnostic services. The cleanliness and organization of the facility instill confidence, and the test results were precise and on time."
      },
      {
        "author": "Madan Kumar Jha",
        "rating": 5,
        "content": "Trust Assure PathLab for precision and care. Their commitment to patient well-being shines through their meticulous testing procedures, making them a trusted partner in healthcare."
      },
      {
        "author": "Rahul Raj",
        "rating": 5,
        "content": "Assure Pathlabs is a great place to have your blood tests done. The staff is very friendly and they take the time to explain everything you need to know about your health and what you can do to keep it. I always recommend them for people that want to have their blood tests done."
      },
      {
        "author": "Ankit Saab",
        "rating": 5,
        "content": "Assure Lab is a great option for blood tests, which I usually use as a screening tool. I like their service as they provide you with all the information you need to know about your health and the procedures you need to go through to achieve."
      },
      {
        "author": "Ritesh Kumar",
        "rating": 5,
        "content": "\"I had a great experience with Assure Pathlabs. Their state-of-the-art facilities and professional team made me feel confident in the accuracy of my test results. Highly recommended!"
      },
      {
        "author": "Shobha Kumari",
        "rating": 5,
        "content": "I ordered a blood test from Assure Pathlabs as a part of my regular medical examination. The entire process was very simple and easy, which I enjoyed a lot! They also provided me with extensive information about my health, which helped me."
      },
      {
        "author": "Kundan Kumar",
        "rating": 5,
        "content": "We were very impressed by the friendly staff at Assure Pathlabs Blood Test Center; they did everything to assure we had the best experience possible while having our blood tests done. The results were good, and we didn't need to go for further tests, which was great!"
      },
      {
        "author": "Minister",
        "rating": 2,
        "content": "They give your test in the normal range to keep patients happy, they keep your previous data and give you similar results which don't match the reports of other labs. Never trust them."
      },
      {
        "author": "Aman Jha",
        "rating": 2,
        "content": "Thanks a ton for reviewing us. We are sorry you had a bad experience. We will reach out to you personally to address it."
      }
    ]
  }
  